// search index for WYSIWYG Web Builder
var database_length = 0;

function SearchPage(url, title, keywords, description)
{
   this.url = url;
   this.title = title;
   this.keywords = keywords;
   this.description = description;
   return this;
}

function SearchDatabase()
{
   database_length = 0;
   this[database_length++] = new SearchPage("index.html", "Мистецтво. 5 клас", "ІНТЕРАКТИВНИЙ ЕЛЕКТРОННИЙ ДОДАТОК    Запрошуємо в чарівний світ образотворчого мистецтва!  Цей е-додаток допоможе вам навчатися легко, цікаво та ефективно Що на вас чекає  Інфографіка уроку  все й одразу Медіатека  переглядайте відеоуроки, майстер-класи, твори мистецтва, відвідайте віртуальні виставки та музеї Інтерактивні вправи  закріплюйте знання через ігри Знайомтеся з образотворчим мистецтвом! Творіть!    © 2026 ТОВ \"Генеза\"   ", "");
   this[database_length++] = new SearchPage("p1.html", "Мистецтво. 5 клас", "РОЗДІЛ I  Мистецтво навколо  Народження мистецтва  Від народних джерел  Мистецтво і спілкування  Мистецтво і довкілля  Різнобарв’я багатоголосся в мистецтві  Почути і побачити мистецтво  Середовище, наповнене мистецтвом  Працюємо з підручником   ", "");
   this[database_length++] = new SearchPage("p2.html", "Мистецтво. 5 клас", "МИСТЕЦТВО НАВКОЛО  Відеоурок  Споглядаємо  ІНТЕРАКТИВНІ ВПРАВИ  Види образотворчого мистецтва  НАЙВАЖЛИВІШЕ   Хто що творить?  Дивимося та слухаємо   ", "");
   this[database_length++] = new SearchPage("p3.html", "Мистецтво. 5 клас", "НАРОДЖЕННЯ МИСТЕЦТВА  ІНТЕРАКТИВНІ ВПРАВИ  Первісне мистецтво  Види первісного мистецтва  НАЙВАЖЛИВІШЕ   Відеоурок  Споглядаємо  Дивимося та слухаємо   ", "");
   this[database_length++] = new SearchPage("p4.html", "Мистецтво. 5 клас", "ВІД НАРОДНИХ ДЖЕРЕЛ  ІНТЕРАКТИВНІ ВПРАВИ  Типи орнаментів  НАЙВАЖЛИВІШЕ   Орнамент  Відеоурок  Споглядаємо  Дивимося та слухаємо   ", "");
   this[database_length++] = new SearchPage("p5.html", "Мистецтво. 5 клас", "МИСТЕЦТВО І СПІЛКУВАННЯ  Відеоурок  ІНТЕРАКТИВНІ ВПРАВИ  НАЙВАЖЛИВІШЕ   Графіка  Дивимося та слухаємо  Споглядаємо  Штрихи  Малюй онлайн   ", "");
   this[database_length++] = new SearchPage("p6.html", "Мистецтво. 5 клас", "МИСТЕЦТВО І ДОВКІЛЛЯ  Відеоурок  ІНТЕРАКТИВНІ ВПРАВИ  НАЙВАЖЛИВІШЕ   Види прикладної графіки  Дивимося та слухаємо  Споглядаємо  Графіка  терміни та поняття  Малюй в стилі піксель-арт онлайн   ", "");
   this[database_length++] = new SearchPage("p7.html", "Мистецтво. 5 клас", "РІЗНОБАРВ’Я БАГАТОГОЛОССЯ В МИСТЕЦТВІ  Відеоурок  ІНТЕРАКТИВНІ ВПРАВИ  НАЙВАЖЛИВІШЕ   Флеш-картки  Дивимося та слухаємо  Споглядаємо  Тестове завдання   ", "");
   this[database_length++] = new SearchPage("p8.html", "Мистецтво. 5 клас", "ПОЧУТИ І ПОБАЧИТИ МИСТЕЦТВО  Відеоурок  ІНТЕРАКТИВНІ ВПРАВИ  НАЙВАЖЛИВІШЕ   Контрастні кольори  Дивимося та слухаємо  Споглядаємо  Склади пазл   ", "");
   this[database_length++] = new SearchPage("p9.html", "Мистецтво. 5 клас", "СЕРЕДОВИЩЕ, НАПОВНЕНЕ МИСТЕЦТВОМ  Відеоурок  ІНТЕРАКТИВНІ ВПРАВИ  НАЙВАЖЛИВІШЕ   Флеш-картки  Дивимося та слухаємо  Споглядаємо  Створення скульптури   ", "");
   this[database_length++] = new SearchPage("pro.html", "Мистецтво. 5 клас", "                                                           Про інтерактивний електронний додаток  Цей е-додаток створено для того, щоб урізноманітнити навчання за підручником, зробити його ефективнішим і цікавішим Контент подано за темами відповідно до змісту підручника   Тут ви можете  ознайомитися з текстом підручника  стисло зрозуміти матеріал уроку за допомогою інфографіки теми  переглянути навчальні та цікаві відео, зображення творів мистецтва, майстер-класи, відвідати віртуальні виставки та музеї, послухати музичні твори  перевірити свої знання за допомогою інтерактивних вправ  Системні вимоги Операційна система — Windows 7 чи пізніші версії, Linux, ChromeOS, macOS, Android, iOS Оперативна пам’ять — 4 ГБ і більше Web browser — усі, що підтримують HTML5 Місце на жорсткому диску  для роботи офлайн  — 2 ГБ і більше  Uicons Flaticon   ", "");
   this[database_length++] = new SearchPage("p2p2.html", "Мистецтво. 5 клас", "СПОГЛЯДАЄМО  Віктор Зарецький Витоки мистецтва  Оксана Шапкаріна.Вишневий компот  Мері Кассатт Дитяча ванна  Георгій Нарбут Автопортрет із сім'єю  Сандро Боттічеллі  «Мадонна дель Магніфікат»   ", "");
   this[database_length++] = new SearchPage("p2p3.html", "Мистецтво. 5 клас", "ДИВИМОСЯ та СЛУХАЄМО  Вивчай мистецтво разом Google Світове мистецтво та культура онлайн   ", "");
   this[database_length++] = new SearchPage("p3p3.html", "Мистецтво. 5 клас", "СПОГЛЯДАЄМО  Наскельний живопис Франція Печера Ласко  Прадавня скульптура мамонта  Відбитки долонь у Cueva de las Manos   Прадавня скульптура бізона   ", "");
   this[database_length++] = new SearchPage("p3p4.html", "Мистецтво. 5 клас", "ДИВИМОСЯ та СЛУХАЄМО  Роздивись давні фігурки тварин з усіх боків Пливучий північний олень  Подивись відео про наскельний живопис у печерах  Фігурка тварини   ", "");
   this[database_length++] = new SearchPage("p4p4.html", "Мистецтво. 5 клас", "СПОГЛЯДАЄМО  Мурал у Харкові  Вікторія Тимошенко Осінь у вазоні  Марфа Тимченко «В нашому дворі»   ", "");
   this[database_length++] = new SearchPage("p4p5.html", "Мистецтво. 5 клас", "ДИВИМОСЯ та СЛУХАЄМО  Цікаві факти про петриківський розпис  Як народжується картина  від Вікторії Тимошенко   Сходинками до майстерності  стрічковий орнамент  Здійсни віртуальний тур до Національного музею народного мистецтва Гуцульщини та Покуття імені Йосафата Кобринського   ", "");
   this[database_length++] = new SearchPage("p5p5.html", "Мистецтво. 5 клас", "СПОГЛЯДАЄМО  Джефф Слейтер Срібний літак  Луїс Вейн Коти  Пабло Пікассо Верблюд, Собака Пінгвін  Луїс Вейн Коти   ", "");
   this[database_length++] = new SearchPage("p5p6.html", "Мистецтво. 5 клас", "ДИВИМОСЯ та СЛУХАЄМО  Вправа «Пейзаж однією лінією»  Переглянь твори Джеффа Слейтера  Вправа «Море»  Намалюй зайчика, відтворюючи мовою графіки його характер  Намалюй їжачка, відтворюючи мовою графіки його характер   ", "");
   this[database_length++] = new SearchPage("p6p6.html", "Мистецтво. 5 клас", "СПОГЛЯДАЄМО  Франтишек Чаннер Планета Земля  Плакат «Don’t kill our wild life»  Пабло Пікассо Верблюд, Собака Пінгвін  Поштова марка «Думай зелено!»  Дарина Істомова Риба   ", "");
   this[database_length++] = new SearchPage("p6p7.html", "Мистецтво. 5 клас", "ДИВИМОСЯ та СЛУХАЄМО  Подивись відео «Що таке комп'ютерна графіка»  Послухай пісню «THIS BEAUTIFUL EARTH»   ", "");
   this[database_length++] = new SearchPage("p7p7.html", "Мистецтво. 5 клас", "СПОГЛЯДАЄМО  Ольга Кваша Травяні роси  Йосип Бокшай Осінь  Вінсент ван Гог Іриси  Ольга Кваша Ніч  Вінсент ван Гог Соняшники  Микола Бурачек Сірий день   ", "");
   this[database_length++] = new SearchPage("p7p8.html", "Мистецтво. 5 клас", "ДИВИМОСЯ та СЛУХАЄМО  Переглянь твори Ольги Кваші  Переглянь твори Йосипа Бокшая  Послухай композицію «Музика осені»  Подивися відео «4 кольори»   ", "");
   this[database_length++] = new SearchPage("p8p8.html", "Мистецтво. 5 клас", "СПОГЛЯДАЄМО  Анрі Матісс Кіт із червоними рибками  Анрі Матісс Червоні рибки   ", "");
   this[database_length++] = new SearchPage("p8p9.html", "Мистецтво. 5 клас", "ДИВИМОСЯ та СЛУХАЄМО  Подивися відео «Кімнатні рослини»   ", "");
   this[database_length++] = new SearchPage("p9p9.html", "Мистецтво. 5 клас", "СПОГЛЯДАЄМО  Робін Уайт Фея з дроту  Ольга Рапай Принцеса і свинопас  фрагмент панно   Дерево, що говорить   парк «Ефтелінг»   Джо Йонг Хо Лев  Джеймс Доран-Вебб Коні  Гаррієт Мід Вівці   ", "");
   this[database_length++] = new SearchPage("p9p10.html", "Мистецтво. 5 клас", "ДИВИМОСЯ та СЛУХАЄМО  Подивися відео «Парк “Ефтелінг”»  Подивися відео «Як видути зі скла ялинкову прикрасу»  Подивися відео «Новорічні іграшки з повітряного пластиліну»   ", "");
   return this;
}
